OpenFOAM_FluidMechanics/Pitching_Airfoil/komegaSST/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh      dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

motionSolver    solidBody;

solidBodyMotionFunction oscillatingRotatingMotion;


patches         (aerofoil);
CofG            (0.5 0 0);

innerDistance   0.01;
outerDistance   4.0; 
       
oscillatingRotatingMotionCoeffs
{
   origin          (0.5 0 0);
   amplitude       (0 0 15);
   omega           6.28;   
}

// ************************************************************************* //
